#include <shlobj.h>
#include "f4se/PluginAPI.h"
#include "f4se_common/f4se_version.h"
#include "f4se_common/Relocation.h"
#include "f4se_common/SafeWrite.h"
#include "f4se/PapyrusVM.h"
#include "f4se/PapyrusNativeFunctions.h"
#include "f4se/GameAPI.h"
#include "f4se/GameData.h"
#include "f4se/GameForms.h"
#include "f4se/GameReferences.h"
#include "f4se/GameObjects.h"
#include "f4se/GameExtraData.h"
#include "f4se/GameRTTI.h"
#include "f4se/GameCamera.h"
#include "f4se/GameInput.h"
#include "f4se/GameSettings.h"
#include "f4se/ScaleformValue.h"
#include "f4se/ScaleformMovie.h"
#include "f4se/Hooks_Scaleform.h"
#include "f4se/ScaleformCallbacks.h"
#include <algorithm>
#include <locale>
#define _USE_MATH_DEFINES
#include <math.h>
#include <random>
#include "LL_FourPlay.h"

//by fedim
#include <fstream>
using namespace std;
#pragma comment(lib,"Winmm.lib")

// Store plugin log in My Games, differentiating between various builds
UInt32 pluginVersion = PLUGIN_VERSION;
char pluginName[] = { PLUGIN_NAME };
char pluginAuthor[] = { PLUGIN_AUTHOR };

char pluginExt[] = {".log"};
char pluginLogPath[] = {"\\My Games\\Fallout4\\F4SE\\"};
#ifdef _DEBUG
	char pluginEdition[] = {"-debug"};
#else
	char pluginEdition[] = {""};
#endif
#ifdef _NOGORE
	char pluginVariant[] = {"-nogore"};
#else
	char pluginVariant[] = {""};
#endif
static char pluginLog[sizeof(pluginLogPath)+sizeof(pluginName)+sizeof(pluginEdition)+sizeof(pluginVariant)+sizeof(pluginExt)];

bool GetCustomConfigOption_float(const char * name, const char * section, const char * key, float * dataOut)
{
	std::string	data = GetCustomConfigOption(name, section, key);
	if(data.empty())
		return false;

	return (sscanf_s(data.c_str(), "%g", dataOut) == 1);
}

bool SetCustomConfigOption(const char * name, const char * section, const char * key, const char * value)
{
	bool result = false;

	const std::string & configPath = GetCustomConfigPath(name);
	if(!configPath.empty())
		result = WritePrivateProfileString(section, key, value, configPath.c_str()) ? true : false;

	return result;
}

bool SetCustomConfigOption_UInt32(const char * name, const char * section, const char * key, UInt32 data)
{
	char value[65536] = "";
	if (!_itoa_s(data, value, 65535, 10))
		return SetCustomConfigOption(name, section, key, value);
	else
		return false;
}

bool SetCustomConfigOption_float(const char * name, const char * section, const char * key, float data)
{
	char value[65536] = "";
	sprintf_s(value, "%g", data);
	return SetCustomConfigOption(name, section, key, value);
}

UInt32 GetMaxArraySize()
{
	UInt32 maxArraySize = 0; // greater than 128 and up to $FFFFFFFF in theory (but don't, seriously). 0 means no change from vanilla
	GetCustomConfigOption_UInt32(pluginCustomIni, "Custom Arrays", "uMaxArraySize", &maxArraySize);
	return maxArraySize;
}

void SetMaxArraySize(UInt32 newMaxArraySize)
{
	#define s_hackArrayAdd 0x01FEBB3D	//	1FEB41D	// 2775A34	// 2775914	// 279A9E4
	#define s_hackArrayInsert 0x01FEC1A5	// 1FEBA85	// 2775FD9	// 2775EB9	// 279AF89
	SafeWrite32(RelocAddr <UInt32 *> (s_hackArrayAdd+2).GetUIntPtr(), newMaxArraySize);		// change maximum size reachable using the .add function of arrays.
	SafeWrite32(RelocAddr <UInt32 *> (s_hackArrayInsert+1).GetUIntPtr(), newMaxArraySize);	// change maximum size reachable using the .insert function of arrays.
}

void GameplayPatches(void)
{
	/**** bypass child test on kill ****/

	#define k_HookChild 0x00DA759A
	UInt32 kk = 0;					// Defaults to not active

	if (GetCustomConfigOption_UInt32(pluginCustomIni, "general", "KK", &kk) && kk)
	{
		// definitivly NOT working. I need more digging :(
		//for (UInt8 i = 0; i < 6; i+=2)
		//	SafeWrite16(RelocAddr <UInt16> (k_HookChild+i).GetUIntPtr(), 0xC032);	// xor al, al
		//_MESSAGE("Killable Kids is active");
	}

	UInt32 maxArraySize = 0; // greater than 128 and up to $FFFFFFFF in theory (but don't, seriously). 0 means no change from vanilla
	if(maxArraySize = GetMaxArraySize())
		SetMaxArraySize(maxArraySize);
}

bool SetMinimalMaxArraySize_internal(UInt32 newMaxArrraySize)
{
	bool result = true;
	UInt32 maxArraySize = 0; // greater than 128 and up to $FFFFFFFF in theory (but don't, seriously). 0 means no change from vanilla
	if(maxArraySize = GetMaxArraySize())
		if (maxArraySize > newMaxArrraySize)
		{
			newMaxArrraySize = maxArraySize;
			result = false;
		}
	if (result)
	{
		SetCustomConfigOption_UInt32(pluginCustomIni, "Custom Arrays", "uMaxArraySize", newMaxArrraySize);
		SetMaxArraySize(newMaxArrraySize);
	}
	return result;
}

/**** papyrus function ****/

class TESForm_LL: public BaseFormComponent
{
public:
	struct Mods
	{
		// Array of mods that contain this form (wether it is an original, a copy of an overwrite).
		// The builtin forms (formID < 0x0800) not overwritten in the game esm have a null mods pointer.
		// Those arrays are shared, as there is only one per combination of overwriting mods.
		// It is the same in Skyrim and Skyrim SE
		ModInfo ** entries;		// 00
		UInt32	size;			// 08
		UInt32	pad0C;			// 0C
	};

	Mods	* mods;		// 08
	UInt32	flags;		// 10	CK also
	UInt32	formID;		// 14	CK also
};

class ExtraPowerArmor_LL: public BSExtraData
{
public:

	UInt32		unk0018;	// 0018
	UInt32		unk001C;	// 001C
	TESRace		*race;		// 0020
	UInt16		unk0028;	// 0028
};

class ExtraLeveledCreature_LL : public BSExtraData
{
public:
	TESForm	* baseForm;		//	018
	UInt8	unk0020[104];	//	020
};

class TESObjectREFR_LL : public TESObjectREFR
{
public:
	static TESObjectREFR_LL* FromRef(TESObjectREFR* ref) { return reinterpret_cast<TESObjectREFR_LL*>(ref); };

	MEMBER_FN_PREFIX(TESObjectREFR_LL);
	DEFINE_MEMBER_FN(SetAngleOnReference, void, 0x004BF810	/* 040BD70 */, NiPoint3);
	DEFINE_MEMBER_FN(SetNoCollision, void, 0x004A00A0	/* 03EDEE0 */, bool);
	DEFINE_MEMBER_FN(GetRefPersists, bool, 0x004A7990	/* 03F4DA0 */);
	DEFINE_MEMBER_FN(SetRefPersists, void, 0x004A79F0	/* 03F4E00 */, bool);
	DEFINE_MEMBER_FN(GetDistanceFromPoint, float, 0x004C32F0	/* 040F560 */)
	DEFINE_MEMBER_FN(GetDistanceFromReference, float, 0x004C33B0	/* 040F620 */, TESObjectREFR const*, bool, bool)
	DEFINE_MEMBER_FN(GetGoldAmount, UInt32, 0x004ADAF0	/* 03FA8D0 */);
	DEFINE_MEMBER_FN(GetMarkerUser, UInt32 *, 0x0050A790	/* 047BD90 */, UInt32 *refHandlePtr, UInt32 MarkerNum, bool abIgnoreReserved); //returns refHandlePtr
	DEFINE_MEMBER_FN(WornHasKeyword, bool, 0x004B36F0	/* 0400050 */, BGSKeyword *kw);
	DEFINE_MEMBER_FN(GetScale, float, 0x004AB5F0 /* 0x03F8540 */);
	DEFINE_MEMBER_FN(SetScale, void, 0x004AB660 /* 0x03F85B0 */, float scale);
};

class Actor_LL : public Actor
{
public:
	static Actor_LL * FromActor(Actor * actor) { return reinterpret_cast<Actor_LL *>(actor);};

	MEMBER_FN_PREFIX(Actor_LL);
	DEFINE_MEMBER_FN(HasPerkInRank, byte, 0x00C0C3F0	/*	0C0C060 0DA6600 0DA64E0, 0DA64E0 */, BGSPerk *);
	DEFINE_MEMBER_FN(SetPosition, void, 0x00BDAB80	/* 0D77690 */, const NiPoint3& a_pos, bool a_updateCharController);		// Actor::Func00CA
	DEFINE_MEMBER_FN(PutCreatedPackage, void, 0x00BFBC30	/* 0D96C70 */, TESForm* a_pack, bool a_tempPack, bool a_isACreatedPackage, bool a_allowFromFurniture);		// Actor::Func00FA
	DEFINE_MEMBER_FN(DisableCollision, void, 0x00BD6E30	/* 0D73AB0 */, void);
	DEFINE_MEMBER_FN(EnableCollision, void, 0x00BD6DA0	/* 0D73A20 */, void);
	DEFINE_MEMBER_FN(StopInteractingQuick, void, 0x00C55FD0	/* 0E0EAA0 */, bool flag1, bool flag2, bool a_initializeNodes);	// It is probably a TESObjectREFR member, rather than an Actor member.
	DEFINE_MEMBER_FN(GetSex, unsigned char, 0x00BD7960	/* 0D74610 */, void);
	DEFINE_MEMBER_FN(GetLevel, UInt32, 0x00BDD41B	/* 0D79E90 */, void);
	DEFINE_MEMBER_FN(IsDead, bool, 0x00BEDE20	/* 0D89D40 */, void);		// Actor::Func00C0
	DEFINE_MEMBER_FN(EvaluatePackage, void, 0x00BE3600 /* 0D7F980 */, bool a_immediate, bool a_resetAI);

	struct AIProcess_LL : AIProcess
	{
		static AIProcess_LL * FromAIProcess(AIProcess * mp) { return reinterpret_cast<AIProcess_LL *>(mp); };
		void * unk00;	// 00
		Data08 * unk08;	// 08

		MEMBER_FN_PREFIX(AIProcess);
		DEFINE_MEMBER_FN(UpdateEquipment, void, 0x00CA12C0	/*	0CA0F30 0E60860 */, Actor * actor, UInt32 flags);
		// action should be 0x35 (DefaultObject kActionIdle), checkConditions should be false, targetObj should be null for AAF idles
		DEFINE_MEMBER_FN(PlayIdle, void, 0x00C75110	/* 0C74D80 0E35510 */, Actor* actor, int action, TESForm* idle, bool checkConditions, TESObjectREFR* targetObj);
		DEFINE_MEMBER_FN(StopCurrentIdle, void, 0x00C754B0	/* 0E358C0 */, Actor* actor, bool a1, bool a2);
		DEFINE_MEMBER_FN(ClearCurrentDataforProcess, void, 0x00CB38C0 /* 0E77520 */, Actor *actor); 
		DEFINE_MEMBER_FN(ClearCurrentPackage, void, 0x00C6B710 /* 0E2A670 */, Actor *actor);
	};
};

// from CommonLibF4
class TESWorldSpace : public TESForm
{
public:
	enum { kTypeID = kFormType_WRLD };
	TESFullName			fullName;
	TESTexture			texture;
	BSTHashMap<int32_t, TESObjectCELL*>	CellMap;
};
STATIC_ASSERT(offsetof(TESWorldSpace, CellMap) == 0x40);

class TESObjectCELL_LL : public TESObjectCELL
{
public:
	static TESObjectCELL_LL* FromCell(TESObjectCELL* cell) { return reinterpret_cast<TESObjectCELL_LL*>(cell); };
	
	MEMBER_FN_PREFIX(TESObjectCELL_LL);
	DEFINE_MEMBER_FN(GetDataXandY, void, 0x00472C70	/* 03B1080 */, int& iX, int& iY);
	DEFINE_MEMBER_FN(GetDataX, int, 0x00472C30	/* 03B1040 */, void);
	DEFINE_MEMBER_FN(GetDataY, int, 0x00472C50	/* 03B1060 */, void);
	DEFINE_MEMBER_FN(GetWorldSpace, TESWorldSpace*, 0x00443DC0	/* 0008880 */, void);
	};

class PlayerCharacter_LL : public PlayerCharacter
{
public:
	static PlayerCharacter_LL* FromPlayerCharacter(PlayerCharacter* plchr) { return reinterpret_cast<PlayerCharacter_LL*>(plchr); };

	MEMBER_FN_PREFIX(PlayerCharacter_LL);
	DEFINE_MEMBER_FN(UpdatePlayer3d, void, 0x00CD68B0	/* 0EA0630 */, void);
};

class TESActorBaseData_LL : public BaseFormComponent
{
public:
	virtual ~TESActorBaseData_LL();

	virtual void	Unk_07(void);
	virtual void	Unk_08(void);
	virtual void	Unk_09(void);

	enum
	{
		kFlagFemale = 0x01,
		kFlagEssential = 0x02,
		kFlagIsPreset = 0x04,
		kFlagRespawn = 0x08,
		kFlagAutoCalcStats = 0x10,
		kFlagUnique = 0x20,
		kFlagDoesntAffectStealthMeter = 0x40,
		kFlagPCLevelMult = 0x80,
		kFlagProtected = 0x800
	};

	enum
	{
		kTemplateTraits = 0,
		kTemplateStats,
		kTemplateFactions,
		kTemplateSpellList,
		kTemplateAIData,
		kTemplateAIPackages,
		kTemplateModelAnimation,
		kTemplateBaseData,
		kTemplateInventory,
		kTemplateScript,
		kTemplateDefPackList,
		kTemplateAttackData,
		kTemplateKeywords,
	};
	typedef TESForm * LPTESForm;
	typedef LPTESForm TemplateArray[13];

	UInt16			flags;				// 08 - 70
	UInt16			unk0A;				// 0A - 72
	UInt16			calcMinLevel;		// 0C - 74
	SInt16			calcMaxLevel;		// 0E - 76
	UInt16			dispositionBase;	// 10 - 78
	UInt16			useTemplateActors;	// 12 - 7A
	UInt16			unk14;				// 14 - 7C
	UInt16			unk16;				// 16 - 7E
	UInt64			unk18;				// 18 - 80
	UInt64			unk20;				// 20 - 88
	BGSVoiceType	* voiceType;		// 28 - 90
	UInt64			unk30;				// 30 - 98
	TemplateArray	* templates;		// 38 - A0
	UInt64			unk40;				// 40 - A8
	UInt64			unk48;				// 48 - B0
	UInt64			unk50;				// 50 - B8
	UInt64			unk58;				// 58 - C0
	UInt64			unk60;				// 60 - C8

	MEMBER_FN_PREFIX(TESActorBaseData_LL);
	DEFINE_MEMBER_FN(ModifyFlag, void, 0x002B5F10	/* 02B5EE0 */, UInt32 flag, bool doSet, bool unk1); // unk1 = 1 (appears to select which actor flags to use)
};
STATIC_ASSERT(sizeof(TESActorBaseData_LL) == 0x68);

// Status of FXCam, if active TFC won't work
	#define k_FXCamIsActive					0x02F6E578	//	2F6D578	// 59DA130	// 59DA100	// 5A13180

	#define k_saveCurrentPlayerCameraState	0x02C773E0	// 2C763E0	// 36F1283	// 3729283
	#define k_CheckIfCameraStateIsSelected	0x00FA5640	// 0FA52B0	// 124E7F0	// 124E6D0	// 124E6D0
	#define k_ToggleFlyCam					0x00FA19A0	// 0FA1610	// 124AE60	// 124AD40	// 124AD40

	#define k_ControlPlayerCamera			0x015551C0	// 1554DF0	// 1B285A0	// 1B28480	// 1B28480
	#define k_ControlPlayer					0x01555290	// 1554EC0	// 1B28690	// 1B28570	// 1B28570

	#define k_fFreeCameraTranslationSpeed_Camera	0x02CC7940	// 2CC6918	// 38048E8	// 383C8E8
	#define k_fFreeCameraRotationSpeed_Camera		0x02CC7958	// 2CC6930	// 3804900	// 383C900

RelocPtr <byte> g_FXCamIsActive(k_FXCamIsActive);
RelocPtr <byte> g_saveCurrentPlayerCameraState(k_saveCurrentPlayerCameraState);

class PlayerCamera_LL : public PlayerCamera
{
public:
	MEMBER_FN_PREFIX(PlayerCamera_LL);
	DEFINE_MEMBER_FN(CheckIfCameraStateIsSelected, bool, k_CheckIfCameraStateIsSelected, UInt32 cmCommand);
	DEFINE_MEMBER_FN(ToggleFlyCam, void, k_ToggleFlyCam, bool pause);
};
RelocPtr <PlayerCamera_LL *> g_playerCamera_LL(0x02E649D8	/* 2E639D8	58CEB28 */);

class InputManager_LL : public InputManager
{
public:
	MEMBER_FN_PREFIX(InputManager_LL);
	DEFINE_MEMBER_FN(ControlPlayerCamera, void, k_ControlPlayerCamera);
	DEFINE_MEMBER_FN(ControlPlayer, void, k_ControlPlayer);
};
RelocPtr <InputManager_LL *> g_inputMgr_LL(0x02F6E628	/* 2F6D628 59DA210 */);


class Main_LL
{
public:
	UInt8	unk00[0x029];	// 00
	UInt8	pause;			// 2A
	UInt8	unk2B[6];		// 2B
};	// 268 allocated
RelocPtr <Main_LL *> g_Main_LL(0x0303ABA8	/* 3039BA8 5ADD2C8 */);

// This should be a template: SettingT<INISettingCollection>
class SettingT_INISettingCollection_LL
{
public:

	virtual void Unk_00();

	float	value;	// 08
	char	*name;	// 0C

	MEMBER_FN_PREFIX(SettingT_INISettingCollection_LL);
	DEFINE_MEMBER_FN(Changed, void, 0x01684DB0	/* 16849E0, 1C91E10 1C91CF0, 1C91CF0 */ );
};	// 10

RelocPtr <SettingT_INISettingCollection_LL> g_fFreeCameraTranslationSpeed_Camera(k_fFreeCameraTranslationSpeed_Camera-8) ;
RelocPtr <SettingT_INISettingCollection_LL> g_fFreeCameraRotationSpeed_Camera(k_fFreeCameraRotationSpeed_Camera-8) ;

bool GetFXCam(StaticFunctionTag *base)
{
	return (*g_FXCamIsActive) ? true : false ;
};

bool GetFlyCam(StaticFunctionTag *base)
{
	PlayerCamera_LL* pc = (*g_playerCamera_LL);
	return CALL_MEMBER_FN(pc, CheckIfCameraStateIsSelected)(PlayerCamera::kCameraState_Free);
};

bool GetPaused(StaticFunctionTag *base)
{
	Main_LL* m = (*g_Main_LL);
	return m->pause ? true : false;
};

bool SetFlyCam(StaticFunctionTag *base, bool activate)
{
	PlayerCamera_LL* pc = (*g_playerCamera_LL);
	InputManager_LL* im = (*g_inputMgr_LL);

	bool current = CALL_MEMBER_FN(pc, CheckIfCameraStateIsSelected)(PlayerCamera::kCameraState_Free);
	if (current != activate && !GetFXCam(base))
	{
		if (!current)
			(*g_saveCurrentPlayerCameraState) = pc->unk30;
		CALL_MEMBER_FN(pc, ToggleFlyCam)(false);
		current = CALL_MEMBER_FN(pc, CheckIfCameraStateIsSelected)(PlayerCamera::kCameraState_Free);
		pc->Unk_02(current  || (*g_saveCurrentPlayerCameraState));
		if (current)
			CALL_MEMBER_FN(im, ControlPlayerCamera)();
		else
			CALL_MEMBER_FN(im, ControlPlayer)();
	}
	return current;
}

bool SetFlyCam2(StaticFunctionTag *base, bool activate, bool pause)
{
	PlayerCamera_LL* pc = (*g_playerCamera_LL);
	InputManager_LL* im = (*g_inputMgr_LL);
	Main_LL* m = (*g_Main_LL);

	bool current = CALL_MEMBER_FN(pc, CheckIfCameraStateIsSelected)(PlayerCamera::kCameraState_Free);
	if (current != activate && !GetFXCam(base))
	{
		if (!current)
			(*g_saveCurrentPlayerCameraState) = pc->unk30;
		CALL_MEMBER_FN(pc, ToggleFlyCam)(pause);
		current = CALL_MEMBER_FN(pc, CheckIfCameraStateIsSelected)(PlayerCamera::kCameraState_Free);
		pc->Unk_02(current  || (*g_saveCurrentPlayerCameraState));
		if (current)
			CALL_MEMBER_FN(im, ControlPlayerCamera)();
		else
			CALL_MEMBER_FN(im, ControlPlayer)();
	}
	else if (current)
	{
		m->pause = pause;
		CALL_MEMBER_FN(im, ControlPlayerCamera)();
	}
	return current;
}

float SetFlyCamSpeedMult(StaticFunctionTag *base, float speed, bool rotation=false)
{
	float result = 0.0;
	if (rotation)
	{
		SettingT_INISettingCollection_LL * rotation = g_fFreeCameraRotationSpeed_Camera;
		result = rotation->value;
		rotation->value = speed;
		CALL_MEMBER_FN(rotation, Changed)();
	}
	else
	{
		SettingT_INISettingCollection_LL * translation = g_fFreeCameraTranslationSpeed_Camera;
		result = translation->value;
		translation->value = speed;
		CALL_MEMBER_FN(translation, Changed)();
	}
	return result;
}

TESRace* GetActorPowerArmorRace(StaticFunctionTag *base, Actor* actor)	// returns the race of an actor when in power armor
{
	if (actor)
	{
		Actor_LL * actor_LL = Actor_LL::FromActor(actor);

		BGSPerk * paPerk = (BGSPerk *)LookupFormByID(0x0001F8A9);
		//if (CALL_MEMBER_FN(actor_LL, HasPerkInRank)(paPerk))
			if (actor->extraDataList)
			{
					ExtraPowerArmor_LL* epa = (ExtraPowerArmor_LL*) actor->extraDataList->GetByType(kExtraData_PowerArmor);
					if (epa && epa->race)
						return epa->race;
			}

		//if (actor->race)
		//	return actor->race;

		//if (actor->baseForm)
		//{
		//	TESNPC* npc = (TESNPC*)Runtime_DynamicCast(actor->baseForm, RTTI_TESForm, RTTI_TESNPC);
		//	if (npc)
		//		return npc->race.race;
		//}
	}
	// if stil nothing then...
	return NULL;
}

BSFixedString GetActorPowerArmorSkeleton(StaticFunctionTag *base, Actor* actor)	// returns the skeleton of an actor when in power armor
{
	if (!actor)
		return "";
	TESNPC * npc = NULL;
	BSFixedString result = "";
	if (actor->baseForm)
		npc = (TESNPC *)Runtime_DynamicCast(actor->baseForm, RTTI_TESForm, RTTI_TESNPC);
	TESRace* race = GetActorPowerArmorRace(base, actor);
	if (race && npc)
		result = race->models[CALL_MEMBER_FN(npc, GetSex)()].name;

	return result;
}

BSFixedString GetActorSkeleton(StaticFunctionTag *base, Actor* actor)
{
	if (!actor)
		return "";
	BSFixedString result = "";
	TESRace* race = NULL;;
	TESNPC * npc = NULL;

	if (actor->baseForm)
		npc = (TESNPC *)Runtime_DynamicCast(actor->baseForm, RTTI_TESForm, RTTI_TESNPC);

	if (actor->race)
		race = actor->race;

	if (!race && npc)
		race = npc->race.race;

	if (race && npc)
		result = race->models[CALL_MEMBER_FN(npc, GetSex)()].name;

	return result;
}

BSFixedString GetActorActualSkeleton(StaticFunctionTag *base, Actor* actor)
{
	if (!actor)
		return "";
	BSFixedString result = "";
	TESRace* race = NULL;;
	TESNPC * npc = NULL;

	if (actor->baseForm)
		npc = (TESNPC *)Runtime_DynamicCast(actor->baseForm, RTTI_TESForm, RTTI_TESNPC);

	if (npc)
		race = npc->race.race;

	if (race)
		result = race->models[CALL_MEMBER_FN(npc, GetSex)()].name;

	return result;
}


UInt32 GetActorFlags(StaticFunctionTag *base, Actor* akActor)
{
	return (akActor) ? akActor->actorFlags : 0;
}

bool ResetActorEssential(StaticFunctionTag * base, Actor* akActor)
{
	bool ret = false;

	if (akActor)
	{
		ExtraDataList *edl = akActor->extraDataList;

		if (edl->HasType(kExtraData_EssentialProtected))
		{
			BSExtraData* edp = akActor->extraDataList->GetByType(kExtraData_EssentialProtected);
			ret = edl->Remove(kExtraData_EssentialProtected, edp);
		}
	}
	return ret;
}


bool SetMinimalMaxArraySize(StaticFunctionTag *base, UInt32 newMaxArrraySize)
{
	return SetMinimalMaxArraySize_internal(newMaxArrraySize);
}

#define MAXDEPTH 4000

static int currDepth = 0;

bool GetInLeveledItem(TESLevItem *lev, TESForm *item)
{
	for (UInt16 i = 0; i < lev->leveledList.length; i++)
	{
		TESForm * member = lev->leveledList.entries[i].form;

		if (member && member->formID == item->formID)
			return true;
			
		TESLevItem *sublist = (TESLevItem*)Runtime_DynamicCast(member, RTTI_TESForm, RTTI_TESLevItem);

		if (sublist && currDepth < MAXDEPTH)
		try
		{
			++currDepth;
			bool r = GetInLeveledItem(sublist, item);
			--currDepth;
			if (r) 
				return r;
		}
		catch(...)
		{
			--currDepth;
			throw;
		}
	}
	return false;
}

bool GetInLeveledItem_(StaticFunctionTag *base, TESLevItem *lev, TESForm *item)
{
	if (item && lev)
		return GetInLeveledItem(lev, item);
	else
		return false;
}

#define MAXLEVEL 1234

SInt32 CheckOneBase(TESNPC * base, SInt32 sex, UInt32 * level);
SInt32 CheckOneLeveled(TESLevCharacter * lev, SInt32 sex, UInt32 * level)
{
	*level++;
	if (*level > MAXLEVEL)
		return -1;
	for (UInt16 i = 0; i < lev->leveledList.length; i++)
	{
		TESForm * member = lev->leveledList.entries[i].form;
		TESNPC * npc = (TESNPC*)Runtime_DynamicCast(member, RTTI_TESForm, RTTI_TESNPC);
		if (npc)
		{
			if (CheckOneBase(npc, sex, level) < 0)
				return -1;
			continue;
		}
		TESLevCharacter * lev = (TESLevCharacter*)Runtime_DynamicCast(member, RTTI_TESForm, RTTI_TESNPC);
		if (lev)
		{
			if (CheckOneLeveled(lev, sex, level) < 0)
				return -1;
			continue;
		}
		_AssertionFailed(NULL, 0, "Logic says it should be an NPC or a leveled character!!!");
	}
	return sex;
}

SInt32 CheckOneBase(TESNPC * base, SInt32 sex, UInt32 * level)
{
	*level++;
	if (*level > MAXLEVEL)
		return -1;
	if (CALL_MEMBER_FN(base, GetSex)() != sex)
		return -1;
	TESActorBaseData_LL * ab = (TESActorBaseData_LL *) (& base->actorData);
	if (((ab->useTemplateActors >> TESActorBaseData_LL::kTemplateTraits) & 1) == 1)
	{
		// TPLT Default Template is not loaded by runtime, so only check the template for traits
		if ((ab->templates) && *(ab->templates))
		{
			TESForm * templ = *(ab->templates)[0];
			TESNPC * npc = (TESNPC*)Runtime_DynamicCast(templ, RTTI_TESForm, RTTI_TESNPC);
			if (npc)
				return CheckOneBase(npc, sex, level);
			TESLevCharacter * lev = (TESLevCharacter*)Runtime_DynamicCast(templ, RTTI_TESForm, RTTI_TESNPC);
			if (lev)
				return CheckOneLeveled(lev, sex, level);
			_AssertionFailed(NULL, 0, "Logic says it should be an NPC or a leveled character!!!");
		}
	}
	return sex;
}

SInt32 GetActorPersistentSex(StaticFunctionTag *base, Actor* actor)	// return value: -1 if sex can change, 0 if always Male, 1 if always female
{
	SInt32 result = -1;
	TESNPC * npc = NULL;
	ExtraLeveledCreature_LL * elc = NULL;
	if (actor && actor->extraDataList)
		elc = (ExtraLeveledCreature_LL *)actor->extraDataList->GetByType(kExtraData_LeveledCreature);	// This is the editor baseForm
	if (elc)
		npc = (TESNPC*)Runtime_DynamicCast(elc->baseForm, RTTI_TESForm, RTTI_TESNPC);
	else
		npc = (TESNPC*)Runtime_DynamicCast(actor->baseForm, RTTI_TESForm, RTTI_TESNPC);
	if (npc)
	{
		SInt32 currentSex = npc->actorData.flags && TESActorBaseData::kFlagFemale ? 1 : 0;
		UInt32 level = 0;
		return CheckOneBase(npc, currentSex, &level);
	}
	return result;
}

// The next three functions are made with code from SKSE's PapyrusStringUtil.cpp file, and modified to work with F4SE. So credits to the extender team!

SInt32 StringFind(StaticFunctionTag* thisInput, BSFixedString theString, BSFixedString toFind, UInt32 startIndex)
{
	if (startIndex < 0)
		startIndex = 0;

	std::string s(theString);
	if (startIndex >= s.length())
		return -1;

	std::transform(s.begin(), s.end(), s.begin(), toupper);

	std::string f(toFind);
	std::transform(f.begin(), f.end(), f.begin(), toupper);

	std::string::size_type pos = s.find(f, startIndex);
	return (pos == std::string::npos) ? -1 : pos;
}

BSFixedString StringSubstring(StaticFunctionTag* thisInput, BSFixedString theString, UInt32 startIndex, UInt32 len)
{

	std::string nullStr;

	if (startIndex < 0)
		return nullStr.c_str();

	std::string tmpStr(theString);
	if (startIndex >= tmpStr.length())
		return nullStr.c_str();

	std::string sub = (len) ? tmpStr.substr(startIndex, len) : tmpStr.substr(startIndex);
	return sub.c_str();
}

VMArray<BSFixedString> StringSplit(StaticFunctionTag* thisInput, BSFixedString theString, BSFixedString theDelimiter)
{
	VMArray<BSFixedString> result;

	std::string str(theString);
	std::string delimiters(theDelimiter);

	std::string::size_type whitespacePos = str.find_first_of(" ");

	while (whitespacePos != std::string::npos) //eliminate whitespace. Taggers should tag with tags that have word starting with a capital letter. EG: "InsideOut", "TheQuickBrownFox"
	{
		str.erase(whitespacePos, 1);
		whitespacePos = str.find_first_of(" ");
	}

	std::string f(str); // Eliminate case sensitivity during find
	std::transform(f.begin(), f.end(), f.begin(), toupper);
	std::transform(delimiters.begin(), delimiters.end(), delimiters.begin(), toupper);

	std::string::size_type lastPos = f.find_first_not_of(delimiters, 0);
	std::string::size_type pos = f.find_first_of(delimiters, lastPos);

	while (std::string::npos != pos || std::string::npos != lastPos)
	{
		std::string token = str.substr(lastPos, pos - lastPos); // Pull from original string
		BSFixedString ConvToken = token.c_str(); //convert token into c string for BSFixedString
		result.Push(&ConvToken);
		lastPos = f.find_first_not_of(delimiters, pos);
		pos = f.find_first_of(delimiters, lastPos);
	}

	return result;
}

BSFixedString StringJoin(StaticFunctionTag* thisInput, VMArray<BSFixedString> theSplitString, BSFixedString theDelimiter) // This joins strings together, delimited by "," by default.
{
	BSFixedString result;
	std::string delimiter(theDelimiter);
	std::string preResult;
	BSFixedString bufferBS;
	std::string nullStr;

	if (theSplitString.Length() == 0)
	{
		return nullStr.c_str();
	}

	if (theSplitString.Length() == 1)
	{
		theSplitString.Get(&bufferBS, 0);
		return bufferBS;
	}

	for (UInt32 i = 0; i < theSplitString.Length(); i++)
	{
		if (i > 0)
		{
			theSplitString.Get(&bufferBS, i);
			std::string buffer(bufferBS);
			preResult = preResult + delimiter + buffer;
		}
		else
		{
			theSplitString.Get(&bufferBS, i);
			std::string buffer(bufferBS);
			preResult = buffer;
		}
	}

	result = preResult.c_str();

	return result;
}

BSFixedString IntToHexString(StaticFunctionTag* base, SInt32 iNum)
{
	char tmpstr[20];
	_itoa_s(iNum, tmpstr, 20, 16);
	return BSFixedString(tmpstr);
}

UInt32 HexStringToInt(StaticFunctionTag* base, BSFixedString theString)
{
	return(strtoul(theString.c_str(), nullptr, 16));
}

BSFixedString GetRaceEditorID(StaticFunctionTag* thisInput, TESRace* theForm)
{

	return BSFixedString(theForm->GetEditorID());

}

template<typename T>
VMArray<T> ResizeArray(StaticFunctionTag* thisInput, VMArray<T> theArray, SInt32 theSize, T fill)
//Most of this code also is from the SKSE cpps, so credits to the SKSE team once again!
//Honestly, this function and the papyrus functions based on it will probably be included in a F4SE release, so expect this to become deprecated.
{
	if (theSize < 0)
		return theArray;

	VMArray<T> result;

	result.Resize(theSize);

	UInt32 arrayLength = min(theArray.Length(), theSize); // Take the lower of the two, so if the size is decreasing, theSize becomes the terminator value for the loop. Otherwise, fill the new array with the old one's data.
	for (UInt32 i = 0; i < arrayLength; i++)
	{
		T value;
		theArray.Get(&value, i);
		result.Set(&value, i);
	}

	arrayLength = max(theArray.Length(), theSize); // Because VMArray doesn't have a Resize() function that takes two vars, we have to manually set the rest of an increased array based on the fill value.
	for (UInt32 i = theArray.Length(); i < arrayLength; i++) // For loop stops if arrayLength is the same as i, which will happen if the array size was decreased.
	{
		result.Set(&fill, i);
	}

	return result;
}

VMArray<VMVariable> ResizeVarArray2(StaticFunctionTag* thisInput, VMArray<VMVariable> theArray, SInt32 theSize/*, VMVariable fill*/)
{
	if (theSize < 0)
		return theArray;

	VMArray<VMVariable> result;

	result.Resize(theSize);

	// Var and None do not mix well, so let the standard lib initialize for us

	//UInt32 arrayLength = min(theArray.Length(), theSize); // Take the lower of the two, so if the size is decreasing, theSize becomes the terminator value for the loop. Otherwise, fill the new array with the old one's data.

	//arrayLength = max(theArray.Length(), theSize); // Because VMArray doesn't have a Resize() function that takes two vars, we have to manually set the rest of an increased array based on the fill value.
	//for (UInt32 i = theArray.Length(); i < arrayLength; i++) // For loop stops if arrayLength is the same as i, which will happen if the array size was decreased.
	//{
	//	if (!fill.IsNone())
	//		result.Set(&fill, i);
	//}

	return result;
}

VMArray<VMVariable> ResizeVarArray(StaticFunctionTag* thisInput, VMArray<VMVariable> theArray, SInt32 theSize, VMVariable fill)
{
	return ResizeVarArray2(thisInput, theArray, theSize);
}

BSFixedString GetCustomConfigPath_(StaticFunctionTag *base, BSFixedString name)
{
	return BSFixedString(GetCustomConfigPath(name).c_str());
};

BSFixedString GetCustomConfigOption_(StaticFunctionTag *base, BSFixedString name, BSFixedString section, BSFixedString key)
{
	return BSFixedString(GetCustomConfigOption(name, section, key).c_str());
};

bool SetCustomConfigOptions_(StaticFunctionTag *base, BSFixedString name, BSFixedString section, VMArray<BSFixedString> keys, VMArray<BSFixedString> values)
{
	return SetCustomConfigOptions(name, section, keys, values);
};

bool GetCustomConfigOptions_(StaticFunctionTag *base, BSFixedString name, BSFixedString section, VMArray<BSFixedString> keys, VMArray<BSFixedString> values)
{
	return GetCustomConfigOptions(name, section, keys, values);
};

VMArray<VMVariable> GetCustomConfigOptions_(StaticFunctionTag *base, BSFixedString name, BSFixedString section)
{
	return GetCustomConfigOptions(name, section);
};

VMArray<BSFixedString> GetCustomConfigSections_(StaticFunctionTag *base, BSFixedString name)
{
	return GetCustomConfigSections(name);
};

bool ResetCustomConfigOptions_(StaticFunctionTag *base, BSFixedString name, BSFixedString section, VMArray<BSFixedString> keys, VMArray<BSFixedString> values)
{
	return ResetCustomConfigOptions(name, section, keys, values);
};

UInt32 GetCustomConfigOption_UInt32_(StaticFunctionTag *base, BSFixedString name, BSFixedString section, BSFixedString key)
{
	UInt32 dataOut = 0;
	return GetCustomConfigOption_UInt32(name, section, key, &dataOut) ? dataOut : 0;
};

float GetCustomConfigOption_float_(StaticFunctionTag *base, BSFixedString name, BSFixedString section, BSFixedString key)
{
	float dataOut = 0;
	return GetCustomConfigOption_float(name, section, key, &dataOut) ? dataOut : 0;
};

bool SetCustomConfigOption_(StaticFunctionTag *base, BSFixedString name, BSFixedString section, BSFixedString key, BSFixedString value)
{
	return SetCustomConfigOption(name, section, key, value);
};

bool SetCustomConfigOption_UInt32_(StaticFunctionTag *base, BSFixedString name, BSFixedString section, BSFixedString key, UInt32 data)
{
	return SetCustomConfigOption_UInt32(name, section, key, data);
};

bool SetCustomConfigOption_float_(StaticFunctionTag *base, BSFixedString name, BSFixedString section, BSFixedString key, float data)
{
	return SetCustomConfigOption_float(name, section, key, data);
};

float GetLLFPPluginVersion(StaticFunctionTag *base)
{
	return pluginVersion;
};

BGSKeyword * GetKeywordByName(BSFixedString editorID)
{
	DataHandler* theDH = *g_dataHandler.GetPtr();
	for (UInt32 i = 0; i < theDH->arrKYWD.count; i++)
	{
		if (0 == _stricmp(theDH->arrKYWD[i]->keyword, editorID))
			return theDH->arrKYWD[i];
	}
	return NULL;
}

BGSKeyword * GetKeywordByName_(StaticFunctionTag *base, BSFixedString editorID)
{
	return GetKeywordByName(editorID);
}

VMArray<BGSKeyword*> GetAllKeywords()
{
	VMArray<BGSKeyword*> result;
	DataHandler* theDH = *g_dataHandler.GetPtr();
	for (UInt32 i = 0; i < theDH->arrKYWD.count; i++)
	{
		//BGSKeyword * k = theDH->arrKYWD[i];
		result.Push(&(theDH->arrKYWD[i]));
	}
	return result;
}

VMArray<BGSKeyword*> GetAllKeywords_(StaticFunctionTag *base)
{
	return GetAllKeywords();
}

// Does not to persist.
bool AddKeywordToForm(TESForm * thisForm, BGSKeyword * keyword)
{
	bool result = false;
	if (!thisForm || !keyword)
		return result;

	BGSKeywordForm* pKeywords = DYNAMIC_CAST(thisForm, TESForm, BGSKeywordForm);
	if (pKeywords) {
		for(UInt32 i = 0; i < pKeywords->numKeywords; i++)
		{
			if(pKeywords->keywords[i] && keyword == pKeywords->keywords[i])
				return false;
		}
		// This keyword is not yet applied to this form, let's add it.
		BGSKeyword	** newKeywords = (BGSKeyword **)Heap_Allocate(sizeof(BGSKeyword*)*(pKeywords->numKeywords+1));
		if (newKeywords)
		{
			for(UInt32 i = 0; i < pKeywords->numKeywords; i++)
				newKeywords[i] = pKeywords->keywords[i];
			newKeywords[pKeywords->numKeywords] = keyword;
			pKeywords->numKeywords++;
			Heap_Free(pKeywords->keywords);
			pKeywords->keywords = newKeywords;
			result = true;
		}
	}
	return result;
}

bool AddKeywordToForm_(StaticFunctionTag *base, TESForm * thisForm, BGSKeyword * keyword)
{
	return AddKeywordToForm(thisForm, keyword);
}

 
bool DelKeywordFromForm(TESForm * thisForm, BGSKeyword * keyword)
{
	bool result = false;
	if (!thisForm || !keyword)
		return result;

	BGSKeywordForm* pKeywords = DYNAMIC_CAST(thisForm, TESForm, BGSKeywordForm);
	if (pKeywords) {
		for(UInt32 i = 0; i < pKeywords->numKeywords; i++)
		{
			if(pKeywords->keywords[i] && keyword == pKeywords->keywords[i])
			{
				// This keyword is applied to this form, let's remove it.
				BGSKeyword	** newKeywords = NULL;
				if (1 < pKeywords->numKeywords)
				{
					// There will at least be one remaining keyword
					newKeywords = (BGSKeyword **)Heap_Allocate(sizeof(BGSKeyword*)*(pKeywords->numKeywords-1));
					if (newKeywords)
					{
						for(UInt32 j = 0; j < pKeywords->numKeywords; j++)
							if (j < i)
								newKeywords[j] = pKeywords->keywords[j];
							else
								if (j > i)
									newKeywords[j-1] = pKeywords->keywords[j];
					}
					else
						return result;
				}
				pKeywords->numKeywords--;
				Heap_Free(pKeywords->keywords);
				pKeywords->keywords = newKeywords;
				result = true;
			}
		}
	}
	return result;
}

bool DelKeywordFromForm_(StaticFunctionTag *base, TESForm * thisForm, BGSKeyword * keyword)
{
	return DelKeywordFromForm(thisForm, keyword);
}
 
// credits to shavkacagarikia for figuring out HasKeyword
typedef bool(*_IKeywordFormBase_HasKeyword)(IKeywordFormBase* keywordFormBase, BGSKeyword* keyword, UInt32 unk3);

template <typename T>
T GetVirtualFunction(void* baseObject, int vtblIndex) 
{
	uintptr_t* vtbl = reinterpret_cast<uintptr_t**>(baseObject)[0];
	return reinterpret_cast<T>(vtbl[vtblIndex]);
}

bool HasKeyword(TESForm* form, BGSKeyword* keyword) 
{
	if (form && keyword)
	{
		IKeywordFormBase* keywordFormBase = DYNAMIC_CAST(form, TESForm, IKeywordFormBase);
		if (keywordFormBase)
		{
			auto HasKeyword_Internal = GetVirtualFunction<_IKeywordFormBase_HasKeyword>(keywordFormBase, 1);
			if (HasKeyword_Internal(keywordFormBase, keyword, 0))
			{
				return true;
			}
		}
	}
	return false;
}

bool HasKeywordInFormList(TESForm *form, BGSListForm* formList)
{
	if (form && formList)
	{
		BGSKeyword *pKW;
		TESForm *pF;
		for (UInt32 i = 0; i < formList->forms.count; i++)
		{
			formList->forms.GetNthItem(i, pF);
			pKW = DYNAMIC_CAST(pF, TESForm, BGSKeyword);
			if (HasKeyword(form, pKW))
				return true;
		}
	}
	return false;
}
 
BSFixedString OriginalPluginName(TESForm* akForm)
{
	TESForm_LL * form = (TESForm_LL *)akForm;
	if (form)
	{
		if (form->formID > 0x01000000 && form->formID < 0xFF000000 && form->mods && form->mods->entries && form->mods->entries[0])
			return form->mods->entries[0]->name;
		else
			return "Fallout4.esm";
	}
	else
		return "";
}

UInt32 OriginalPluginID(TESForm* akForm)
{
	char name[0x0104];
	strcpy_s(name, OriginalPluginName(akForm));
	char * dot = strrchr(name, '.');
	//if (dot)
	//	for (char * c = dot; c ; c++)
	//		*c = toupper(*c);
	if (dot && 0==_stricmp(dot, ".ESL"))
		return akForm->formID & 0x0000FFFF;
	else
		return akForm->formID & 0x00FFFFFF;
}

BSFixedString OriginalPluginName_(StaticFunctionTag *base, TESForm* akForm)
{
	return OriginalPluginName(akForm);
}

UInt32 OriginalPluginID_(StaticFunctionTag *base, TESForm* akForm)
{
	return OriginalPluginID(akForm);
}

UInt32 GetRecordFlags(StaticFunctionTag *base, TESForm* akForm)
{
	return (akForm) ? akForm->flags : 0;
}

UInt32 GetFormType(StaticFunctionTag *base, TESForm* akForm)
{
	return (akForm) ? akForm->GetFormType() : 0;
}

bool IsPersistent(StaticFunctionTag *base, TESForm* akForm)
{
	bool result = false;

	if (akForm)
	{
		TESObjectREFR *ref = DYNAMIC_CAST(akForm, TESForm, TESObjectREFR);
		if (ref)
			result = CALL_MEMBER_FN(TESObjectREFR_LL::FromRef(ref), GetRefPersists)();
	}
	return result;
}

bool SetPersistent(StaticFunctionTag *base, TESForm* akForm, bool bValue)
{
	bool result = false;

	if (akForm)
	{
		TESObjectREFR *ref = DYNAMIC_CAST(akForm, TESForm, TESObjectREFR);
		if (ref)
		{
			CALL_MEMBER_FN(TESObjectREFR_LL::FromRef(ref), SetRefPersists)(bValue);
			result = true;
		}
	}
	return result;
}

float GetScale(StaticFunctionTag* base, TESObjectREFR* akRef)
{
	float result = 0.0;

	if (akRef)
	{
		result = CALL_MEMBER_FN(TESObjectREFR_LL::FromRef(akRef), GetScale)();
	}
	return result;
}

void SetScale(StaticFunctionTag *base, TESObjectREFR* akRef, float fScale)
{
	if (akRef)
	{
		CALL_MEMBER_FN(TESObjectREFR_LL::FromRef(akRef), SetScale)(fScale);
	}
}

VMArray<TESForm*> FormListToArray(StaticFunctionTag* base, BGSListForm* formList)
{
	VMArray<TESForm*> result;
	if (formList)
	{
		for (UInt32 i = 0; i < formList->forms.count; i++)
		{
			TESForm* form = nullptr;
			formList->forms.GetNthItem(i, form);
			if (form)
				result.Push(&form);
		}
	}
	return result;
}

UInt32 GetFullFormID(StaticFunctionTag *base, BSFixedString modName, UInt32 formID)
{
	if (!modName)
		return 0;

	const ModInfo *mod = (*g_dataHandler)->LookupModByName(modName.c_str());

	if (mod && mod->modIndex != -1) {
		if (mod->recordFlags & (1 << 9)) { // ESL
			formID &= 0xFFF;
			formID |= 0xFE << 24;
			formID |= mod->lightIndex << 12;
		}
		else {
			formID &= 0xFFFFFF;
			formID |= (mod->modIndex) << 24;
		}
		return formID;
	}
	return 0;
}

TESForm * GetFormFromPlugin(StaticFunctionTag *base, BSFixedString modName, UInt32 formID)
{
	UInt32 fullFormID = GetFullFormID(base, modName, formID);

	return LookupFormByID(fullFormID);
}

VMArray<TESForm *> GetFormArray(StaticFunctionTag *base, VMArray<BSFixedString> modNames, VMArray<UInt32> formIDs)
{
	VMArray<TESForm *> result;
	BSFixedString modName;
	UInt32 formID;
	TESForm *formptr;

	if (modNames.Length() != formIDs.Length())
		return result;

	UInt32 mln = modNames.Length();
	for (UInt32 i = 0; i < mln; i++)
	{
		modNames.Get(&modName, i);
		formIDs.Get(&formID, i);
		formptr = GetFormFromPlugin(base, modName, formID);
		if (formptr)
			result.Push(&formptr);
	}
	return result;
}

// Given an array of FormID Ints that was packed as Var via VarArrayToVar(), return the array of corresponding forms
VMArray<TESForm *> GetFormArrayFromVar(StaticFunctionTag *base, VMVariable var)
{
	VMArray<TESForm *> result;

	VMArray<VMVariable> vars;
	var.Get<VMArray<VMVariable>>(&vars);
	
	UInt32 formID;
	VMVariable tmpVar;
	TESForm *formPtr;
	UInt32 len = vars.Length();

	for (UInt32 i = 0; i < len; i++)
	{
		vars.Get(&tmpVar, i);
		tmpVar.Get(&formID);
		formPtr = LookupFormByID(formID);
		if (formPtr)
			result.Push(&formPtr);
	}
	return result;
}

// 04B0AC0 void __fastcall BGSListForm::AddScriptAddedForm(BGSListForm *this, struct TESForm *akForm)
typedef bool(*_AddScriptAddedForm)(BGSListForm *FormList, TESForm *akForm);
RelocAddr<_AddScriptAddedForm> AddScriptAddedForm(0x00535230	/* 0535200 04B0AC0 */);

void PopulateFormlist(StaticFunctionTag *base, BGSListForm *FormList, VMArray<BSFixedString> modNames, VMArray<UInt32> formIDs)
{
	BSFixedString modName;
	UInt32 formID;
	TESForm *formPtr;

	if (modNames.Length() != formIDs.Length() || !FormList)
		return;

	UInt32 mln = modNames.Length();
	for (UInt32 i = 0; i < mln; i++)
	{
		modNames.Get(&modName, i);
		formIDs.Get(&formID, i);
		formPtr = GetFormFromPlugin(base, modName, formID);
		if (formPtr)
		{
			AddScriptAddedForm(FormList, formPtr);
		}
	}
	return;
}


void PlayIdle(StaticFunctionTag *base, Actor* actor, TESForm* idle)
{
	if(!actor || !idle)
		return;

	// There is probably a better way to do this
	Actor_LL::AIProcess_LL *middleProcess = static_cast<Actor_LL::AIProcess_LL *>(actor->middleProcess);

	TESForm *tF = (TESForm*)DYNAMIC_CAST(actor, Actor, TESForm);
	if (middleProcess && !(tF->flags & (TESForm::kFlag_IsDeleted | TESForm::kFlag_IsDisabled)))
		CALL_MEMBER_FN(middleProcess, PlayIdle)(actor, 0x35, idle, false, nullptr);
}


void PlayMultipleIdles(StaticFunctionTag *base, VMArray<Actor*> actors, VMArray<TESForm*> idles)
{
	int numActors = actors.Length();
	if (numActors == idles.Length())
	{
		Actor **tActors = new Actor*[numActors];
		TESForm **tIdles = new TESForm *[numActors];
		Actor_LL::AIProcess_LL**tMiddles = new Actor_LL::AIProcess_LL *[numActors];

		int j = 0;
		// Unpack everything to reduce latency. Skip deleted and disabled Actors.
		for (int i = 0; i < numActors; i++)
		{
			actors.Get(&tActors[j], i);
			idles.Get(&tIdles[j], i);
			if (tActors[j] && tIdles[j])
			{
				tMiddles[j] = static_cast<Actor_LL::AIProcess_LL*>(tActors[j]->middleProcess);
				if (tMiddles[j])
				{
					TESForm *tF = (TESForm*)DYNAMIC_CAST(tActors[j], Actor, TESForm);
					if ((tF->flags & (TESForm::kFlag_IsDeleted | TESForm::kFlag_IsDisabled)) == 0)
						++j;
				}
			}
		}

		for (int i = 0; i < j; i++)
			CALL_MEMBER_FN(tMiddles[i], PlayIdle)(tActors[i], 0x35, tIdles[i], false, nullptr);

		delete(tActors);
		delete(tIdles);
		delete(tMiddles);
	}
}

void StopCurrentIdle(StaticFunctionTag* base, Actor* actor)
{
	if (actor)
	{
		Actor_LL::AIProcess_LL* middleProcess = static_cast<Actor_LL::AIProcess_LL*>(actor->middleProcess);

		if (middleProcess)
			CALL_MEMBER_FN(middleProcess, StopCurrentIdle)(actor, true, true);
	}
}

// code originally from HUD++ plugin by kassent (on GitHub)

struct ViewCasterUpdateEvent_LL
{
    struct ViewCasterValueEvent_LL
    {
      UInt32			crosshairHandler;	// 00	RefHandler
      UInt32			unk04;				// 04
      UInt32			unk08;				// 08
      UInt32			unk0C;				// 0C
      UInt64			unk10;				// 10
      UInt64			unk18;				// 18
      UInt32			unk20;				// 20
      UInt32			unk24;				// 24
    };
	ViewCasterValueEvent_LL value;			// 00
	bool					unk28;			// 28
	UInt32					unk2C;			// 2C
	bool					isNPC;			// 30 ?
	float					unk34;			// 34
	bool					canInteractive;	// 38
};
STATIC_ASSERT(sizeof(ViewCasterUpdateEvent_LL) == 0x40);

template <typename EventT>
class BSTEventDispatcher_LL	// BSTGlobalEvent::EventSource<typename EventT> : public struct BSTSingletonSDM<EventT,BSTSingletonSDMOpStaticBuffer>, BSTEventSink<BSTGlobalEvent::KillSDMEvent>, BSTEventSource<ViewCasterUpdateEvent>
{
public:
	typedef BSTEventSink<EventT> SinkT;

	bool AddEventSink(SinkT * sink)
	{
		SimpleLocker locker(&lock);

		// Check for duplicate first
		for (int i = 0; i < eventSinks.count; i++)
		{
			if(eventSinks[i] == sink)
				return false;
		}

		if(!eventSinks.Insert(0, sink))
			eventSinks.Push(sink);
		return true;
	}

	void RemoveEventSink(SinkT * sink)
	{
		SimpleLocker locker(&lock);

		for (int i = 0; i < eventSinks.count; i++)
		{
			if(eventSinks[i] == sink) {
				eventSinks.Remove(i);
				break;
			}
		}
	}

	SimpleLock			lock;				// 000
	tArray<SinkT*>		eventSinks;			// 008
	tArray<SinkT*>		addBuffer;			// 020
	tArray<SinkT*>		removeBuffer;		// 038
	bool				stateFlag;			// 050
	char				pad[3];
};

#define kEventSource 0x02FF12F0	// 2FF02F0	// 5A5F758	// 5A5F728	// 5A987A8	
	// BSTGlobalEvent::EventSource_ViewCasterUpdateEvent_::Func0000+22
	// g_BSTGlobalEvent::EventSource_ViewCasterUpdateEvent_ or __ICI__BSTValueEventSource_ViewCasterUpdateEvent___Func0000_to0053_to0051_to0160+24
typedef BSTEventDispatcher<ViewCasterUpdateEvent_LL> EventDispatcher;
typedef BSTGlobalEvent::EventSource<ViewCasterUpdateEvent_LL> EventSource;
RelocPtr<EventSource *> g_Source(kEventSource);

static UInt32 CrosshairRefHandle = 0;		// Zero if the crosshair is no longer on a reference
static UInt32 CrosshairActorHandle = 0;		// Memorize the last one until a new one is pointed at

class CrosshairChangeHandler_LL : public BSTEventSink<ViewCasterUpdateEvent_LL>
{
public:
	virtual ~CrosshairChangeHandler_LL() { };
	virtual	EventResult	ReceiveEvent(ViewCasterUpdateEvent_LL * evn, void * dispatcher) override
	{
		NiPointer<TESObjectREFR> pRef = nullptr;
